#Создать список из десяти целых чисел.
#Вывести на экран каждое число, увеличенное на 1.

for i in range (10):
	i += 1
	print (i)


input_word = str(input('Введите текст: '))
word = input_word
for letter in word:
	print (letter)